# Resampling pada data deret waktu

## Import Modules

In [3]:
import pandas as pd
import numpy as np

print("Pandas version:", pd.__version__,
      "\nNumPy version:", np.__version__)

Pandas version: 2.2.3
NumPy version: 2.1.3

## Persiapan Data Frame

In [6]:
n_rows = 365 * 24
n_cols = 2
cols = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df.index = pd.date_range(start='2000-01-01', periods=n_rows, freq='h')

df

                     col1  col2
2000-01-01 00:00:00     1    19
2000-01-01 01:00:00    10    10
2000-01-01 02:00:00    19    10
2000-01-01 03:00:00     1     8
2000-01-01 04:00:00    16     5
...                   ...   ...
2000-12-30 19:00:00     2    16
2000-12-30 20:00:00    10    11
2000-12-30 21:00:00     8    10
2000-12-30 22:00:00    17     6
2000-12-30 23:00:00    11    14

[8760 rows x 2 columns]

## Resampling data dengan interval montly

In [ ]:
(df.resample('ME')
   ['col1']
   .sum()
   .to_frame())

            col1
2000-01-31  7449
2000-02-29  6993
2000-03-31  7384
2000-04-30  7106
2000-05-31  7569
2000-06-30  7253
2000-07-31  7231
2000-08-31  7485
2000-09-30  7463
2000-10-31  7594
2000-11-30  7131
2000-12-31  6946

## Resampling data dengan interval day

In [11]:
(df.resample('D')
   ['col1']
   .sum()
   .to_frame())

            col1
2000-01-01   219
2000-01-02   229
2000-01-03   248
2000-01-04   282
2000-01-05   241
...          ...
2000-12-26   224
2000-12-27   231
2000-12-28   258
2000-12-29   227
2000-12-30   232

[365 rows x 1 columns]

## Resampling data dengan interval year

In [13]:
(df.resample('YE')
   ['col1']
   .sum()
   .to_frame())

             col1
2000-12-31  87604